### Local tests
```
$ terraform plan
var.serviceregistry_api
  Service registry API endpoint to test against

  Enter a value: 
```

With Production `serviceregistry API endpoint` the following results are produced:
```
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.s3_test_bucket_cores.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_versioning.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_bucket_encryption.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_lifecycle.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_with_policy.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_lifecycle.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_with_policy.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_acl_grants.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_bucket_different_region.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_bucket_encryption.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_bucket_cores.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_acl_grants.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_bucket_with_app.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_versioning.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_bucket_with_team.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_bucket_different_region.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_logging.module.team_org.data.http.team_org: Refreshing state...
module.s3_test_bucket_with_app.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_logging.module.ownership.data.http.service_owner: Refreshing state...
module.s3_test_bucket_with_team.module.team_org.data.http.team_org: Refreshing state...

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.s3_test_acl_grants.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-acl-grants"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket: please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + grant {
          + permissions = [
              + "READ",
            ]
          + type        = "Group"
          + uri         = "http://acs.amazonaws.com/groups/global/AllUsers"
        }
      + grant {
          + permissions = [
              + "READ_ACP",
              + "WRITE",
            ]
          + type        = "Group"
          + uri         = "http://acs.amazonaws.com/groups/s3/LogDelivery"
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_bucket_cores.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-cors-rules"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket: please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = []
          + max_age_seconds = 3000
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_bucket_different_region.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-different-region"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-west-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket: please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_bucket_encryption.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-encryption"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket: please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_bucket_with_app.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-with-app-tag"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "app"       = "echo"
          + "concern"   = "This is a test bucket: please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_bucket_with_team.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-with-team-tag"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket: please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_lifecycle.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-lifecycle"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket: please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 0
          + enabled                                = true
          + id                                     = "expire-and-delete-after-30-days"

          + expiration {
              + days                         = 30
              + expired_object_delete_marker = false
            }

          + noncurrent_version_expiration {
              + days = 1
            }
        }
      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 0
          + enabled                                = true
          + id                                     = "S3 transition to INTELLIGENT_TIERING"

          + noncurrent_version_transition {
              + days          = 3
              + storage_class = "INTELLIGENT_TIERING"
            }

          + transition {
              + days          = 3
              + storage_class = "INTELLIGENT_TIERING"
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_logging.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-logging"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket: please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + grant {
          + permissions = [
              + "READ_ACP",
              + "WRITE",
            ]
          + type        = "Group"
          + uri         = "http://acs.amazonaws.com/groups/s3/LogDelivery"
        }

      + logging {
          + target_bucket = "od-test-logging"
          + target_prefix = "logs/"
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.s3_test_versioning.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-versioning"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket: please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

  # module.s3_test_with_policy.aws_s3_bucket.s3_bucket will be created
  + resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "od-test-with-policy"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + policy                      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = "*"
                      + Resource  = "arn:aws:s3:::od-test-with-policy/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + region                      = "us-east-2"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Terraform" = "github.com/opendoor-labs/od-terraform/tests"
          + "concern"   = "This is a test bucket: please ignore"
          + "env"       = "staging"
          + "org"       = "infra"
          + "team"      = "cloud-infra"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

Plan: 10 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------
```